//                 Задание
// Написать код, который выводит "Hello, world"
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello, world!");
    }
}